app/views/posts/_like.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
---
<% if post.liked_by?(current_user) %>
  <% like = Like.find_by(user_id: current_user.id, post_id: post.id) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]
---
    <span class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;">
    <span><%= post.likes.count %></span>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]
---
    <span class="glyphicon glyphicon-heart" aria-hidden="true" style="color: gray;">
    <span><%= post.likes.count %></span>