app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["created_at", "2020-08-13 16:43:23.723940"], ["updated_at", "2020-08-13 16:43:23.723940"]]
---
  def create
		like = Like.new(user_id: current_user.id, post_id: params[:post_id])
		@post = like.post
		like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 17]]
---
  def destroy
		like = Like.find(params[:id])
		@post = like.post
		like.destroy