app/controllers/posts_controller.rb

  def create
  	@post = Post.new(post_params)
  	@post.user_id = current_user.id
  	@post.save
---
INSERT INTO "posts" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "テスト１"], ["user_id", 1], ["created_at", "2020-08-13 15:26:05.002432"], ["updated_at", "2020-08-13 15:26:05.002432"]]